"""
Соболева П.
ПКС-1
4 курс

# Напишите программу, которая выводит на экран все цифры числа, начиная с первой.
"""

num = int(input("введите число: "))

for digit in str(num):
    print(digit)
