
'''
    Напишите программу, которая выводит на экран все цифры числа, начиная с первой.
'''

print('Перечисление всех цифр введенного числа..\n');

A = int(input("print number --> "));

for d in str(A):
    print(d);
