# -*- coding: cp1251 -*-

'''
    »спользу€ сначала цикл с условием, а потом Ц цикл с переменной, напишите программу, котора€ выводит на экран чЄтные степени числа 2 от 2^10 до 2^2
    в пор€дке убывани€
'''

i = 10;
while i > 1:
    print(2**i);
    i-=2;