# -*- coding: cp1251 -*-

'''
    Напишите программу, которая строит последовательность из N случайных чисел на отрезке 
    от 0 до 1 и определяет, сколько из них попадает на отрезки [0; 0,25), [0,25; 0,5), [0,5; 0,75) и 
    [0,75; 1).
'''

import random;

print("Определение категорий псевдослучайных чисел (0..1)..\n");

count = int(input("введите кол-во псевдослучайных чисел: "));

c1 = 0; # [0; 0,25)
c2 = 0; # [0,25; 0,5)
c3 = 0; # [0,5; 0,75)
c4 = 0; # [0,75; 1)

i = 0;
while i < count:
    num = random.random() * 100;

    if(0 <= num < 25):
        c1+=1;
    if(25 <= num < 50):
        c2+=1;
    if(50 <= num < 75):
        c3+=1;
    if(75 <= num < 100):
        c4+=1;

    i+=1;

print("[0; 0,25)   -", c1, "|", f"{c1/count*100}%")
print("[0,25; 0,5) -", c2, "|", f"{c2/count*100}%")
print("[0,5; 0,75) -", c3, "|", f"{c3/count*100}%")
print("[0,75; 1)   -", c4, "|", f"{c4/count*100}%")