
#Напишите программу, которая вводит координаты точки на плоскости и определяет, попала
#ли эта точка в заштрихованную область.

x = float(input('Координата Х: '))
y = float(input('Координата Y: '))

print('рисунок А:', end=' ')
if y <= 1:
    print('+')
else:
    print('-')

print('рисунок Б:', end=' ')
if x + y <= 0:
    print('+')
else:
    print('-')

print('рисунок В:', end=' ')
if x**2 + y**2 -1 <= 0:
    print('+')
else:
    print('-')

print('рисунок Г:', end=' ')
if (x-1)**2 + y**2 - 1 <= 0:
    print('+')
else:
    print('-')