
print("Словесное название числа от 1 до 100 (не включительно)..\n");

num = int(input("введите число: "));

if 1 <= num < 100:
    res = "";

    if 11 <= num <= 19:
        if num == 11: res += "одинадцать";
        if num == 12: res += "двенадцать";
        if num == 13: res += "тринадцать";
        if num == 14: res += "четырнадцать";
        if num == 15: res += "пятнадцать";
        if num == 16: res += "шестнадцать";
        if num == 17: res += "семнадцать";
        if num == 18: res += "восемнадцать";
        if num == 19: res += "девятнадцать";

    else:
        d1 = num // 10;
        d2 = num % 10;

        if d1 == 1: res += "десять";
        if d1 == 2: res += "двадцать";
        if d1 == 3: res += "тридцать";
        if d1 == 4: res += "сорок";
        if d1 == 5: res += "пятьдесят";
        if d1 == 6: res += "шестьдесят";
        if d1 == 7: res += "семьдесят";
        if d1 == 8: res += "восемьдесят";
        if d1 == 9: res += "девяносто";

        res += " ";

        if d2 == 1: res += "один";
        if d2 == 2: res += "два";
        if d2 == 3: res += "три";
        if d2 == 4: res += "четыре";
        if d2 == 5: res += "пять";
        if d2 == 6: res += "шесть";
        if d2 == 7: res += "семь";
        if d2 == 8: res += "восемь";
        if d2 == 9: res += "девять";

    print(res);

else: print("Ошибка! Некорректное число!")