"""
Соболева ПКС-1 
Напишите процедуру, которая выводит переданное ей число прописью. 
Например, 21 «двадцать один».
"""

def show_number(num):
    if 1 <= num < 100:
        res = ""

        if 11 <= num <= 19:
            if num == 11:
                res += "Одиннадцать"
            if num == 12:
                res += "Двенадцать"
            if num == 13:
                res += "Тринадцать"
            if num == 14:
                res += "Четырнадцать"
            if num == 15:
                res += "Пятнадцать"
            if num == 16:
                res += "Шестнадцать"
            if num == 17:
                res += "Семнадцать"
            if num == 18:
                res += "Восемнадцать"
            if num == 19:
                res += "Девятнадцать"

        else:
            d1 = num // 10
            d2 = num % 10

            if d1 == 1:
                res += "Десять"
            if d1 == 2:
                res += "Двадцать"
            if d1 == 3:
                res += "Тридцать"
            if d1 == 4:
                res += "Сорок"
            if d1 == 5:
                res += "Пятьдесят"
            if d1 == 6:
                res += "Шестьдесяят"
            if d1 == 7:
                res += "Семьдесят"
            if d1 == 8:
                res += "Восемьдесят"
            if d1 == 9:
                res += "Девяносто"

            res += " "

            if d2 == 1:
                res += "Один"
            if d2 == 2:
                res += "Два"
            if d2 == 3:
                res += "Три"
            if d2 == 4:
                res += "Четыре"
            if d2 == 5:
                res += "Пять"
            if d2 == 6:
                res += "Шесть"
            if d2 == 7:
                res += "Семь"
            if d2 == 8:
                res += "Восемь"
            if d2 == 9:
                res += "Девять"

        print(res)

    else:
        print("Ахтунг! Введи двузначное число!")


show_number(int(input("print num --> ")))
