"""
Соболева ПКС-1
Напишите функцию, которая вычисляет количество цифр числа
"""

def length(num):
    return len(str(num))


print(length(552414234197))
