# -*- coding: cp1251 -*-

"""
    Напишите функцию, которая вычисляет количество цифр числа
"""

# функция считает кол-во цифр в числе
def length(number):
    return len(str(number))


print(length(552414234197))
