"""
Соболева П.
ПКС-1
4 курс
"""

x = float(input("введите x: "))
y = float(input("введите y: "))

# a (y = 1)
if y <= 1:
    print("а) попала")
else:
    print("а) не попала")

# б (y = -x)
if y <= -x:
    print("б) попала")
else:
    print("б) не попала")

# в (окружность) x^2 + y^2 == r^2
if x**2 + y**2 <= 1:
    print("в) попала")
else:
    print("в) не попала")

# г (окружность с центром на 1 правее) (x-1)^2 + y^2 == r^2
if (x - 1)**2 + y**2 <= 1:
    print("г) попала")
else:
    print("г) не попала")
